Catalogs/ГруппыШаблоновЗаявок_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ГруппыШаблоновЗаявок_ат</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Индивидуальная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ГруппыШаблоновЗаявок_ат/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.Ссылка.Пустая() И Объект.Родитель = Справочники.ГруппыШаблоновЗаявок_ат.ВсеШаблоны Тогда
		Объект.Родитель = Неопределено;
	КонецЕсли;
	
	Если Объект.Ссылка = Справочники.ГруппыШаблоновЗаявок_ат.ВсеШаблоны Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;

	Элементы.Пользователь.Видимость = Объект.Индивидуальная;
	
КонецПроцедуры

&НаКлиенте
Процедура ИндивидуальнаяПриИзменении(Элемент)
	
	Элементы.Пользователь.Видимость = Объект.Индивидуальная;
	
КонецПроцедуры
